export default {
  HERO_TEXT: {
    header: "Привет, я Артём 👋",
    about: "Я фронтенд разработчик (React.js & Next.js) с акцентом на создание исключительных цифровых продуктов, которые являются быстрыми, доступными, визуально привлекательными и отзывчивыми. Несмотря на то, что я создаю веб-приложения уже более двух лет, мне все еще нравится это, как будто это что-то новое.",
    location: "Санкт-Петербург, Россия",
    available: "Готов к новым проектам",
  },
  ABOUT_SECTION: {
    title: 'Обо мне',
    subTitle: "Немного информации обо мне:",
    text: "Я программист, специализирующийся на разработке интерфейсов (React.js & Next.js). Я с большим энтузиазмом отношусь к воплощению технических и визуальных аспектов цифровых продуктов в жизнь. Для меня важен пользовательский опыт, идеальный дизайн и написание четкого, читаемого, высокопроизводительного кода.\n\nЯ начал свой путь в качестве веб-разработчика в 2020 году, и с тех пор я продолжаю расти и эволюционировать как разработчик, беру на себя новые задачи и попутно изучаю новейшие технологии. Сейчас, когда мне чуть за тридцать, через два года после начала моей карьеры веб-разработчика, я создаю передовые веб-приложения, используя современные технологии, такие как Next.js, TypeScript, Nestjs, Tailwindcss и многое другое.\n\nЯ очень прогрессивно мыслю, и мне нравится работать над продуктами от начала до конца, от идеи до разработки.\n\nВы можете посмотреть мои проекты на [GitHub](https://github.com/Artem-Mit).",
  },
  SKILLS_SECTION: {
    title: 'Навыки',
    subTitle: 'Навыки, инструменты и технологии, в которых я действительно хорош:',
    skills: [
      {
        name: 'JavaScript',
        imgUrl: '../images/icon-javascript.svg'
      },
      {
        name: 'Typescript',
        imgUrl: '../images/icon-typescript.svg'
      },
      {
        name: 'React',
        imgUrl: '../images/icon-react.svg'
      },
      {
        name: 'NextJS',
        imgUrl: '../images/icon-nextjs.svg'
      },
      {
        name: 'NodeJS',
        imgUrl: '../images/icon-nodejs.svg'
      },
      {
        name: 'Express',
        imgUrl: '../images/icon-express.svg'
      },
      {
        name: 'Tailwind CSS',
        imgUrl: '../images/icon-tailwindcss.svg'
      },
      {
        name: 'Sass',
        imgUrl: '../images/icon-sass.svg'
      },
      {
        name: 'Figma',
        imgUrl: '../images/icon-figma.svg'
      },
      {
        name: 'GIT',
        imgUrl: '../images/icon-git.svg'
      },
      {
        name: 'Mongo DB',
        imgUrl: '../images/icon-mongodb.svg'
      },

      {
        name: 'Storybook',
        imgUrl: '../images/icon-storybook.svg'
      },


    ]
  },
  CONTACTS_SECTION: {
    title: 'Связаться со мной',
    subTitle: "Что дальше? Не стесняйтесь обращаться ко мне, если вы ищете разработчика, у вас есть вопрос или просто хотите пообщаться.",
    email: 'artem.v.mitin@yandex.ru',
    phone: '+7-921-913-91-21'
  },
  WORKS_SECTION: {
    title: 'Работы',
    subTitle: 'Извините... Данная страница до сих пор в разработке 😒',
  },
  FOOTER: {
    text: 'Разработано с ❤️️ Митин.Арт'
  },
  NAV_LINKS: {
      about: 'Обо мне',
      works: 'Работы',
      contacts: 'Контакты',
  },
  DOWNLOAD: {
    text: 'Резюме'
  },
  ANOTHER_LANGUAGE: {
    lang: 'En'
  }
} as const